MikroElektronika/core_packages/ARM/gcc_clang/def/holtek/HT32F61152-46QFN/mcu.h
/******  HT32 Specific Interrupt Numbers ***************************************                            */
  LVD_BOD_IRQn            = 0,      /*!< Low voltage & Brown-out detection interrupt                        */
  #if !defined(USE_HT32F52220_30)
  RTC_IRQn                = 1,      /*!< RTC Wake-up Interrupt                                              */
  #endif
  FLASH_IRQn              = 2,      /*!< FLASH global Interrupt                                             */
  EVWUP_IRQn              = 3,      /*!< EXTI Event Wake-up & WAKEUP pin Interrupt                          */
  #if defined(USE_HT32F66256)
  EXTI0_7_IRQn            = 4,      /*!< EXTI0-7 Line detection Interrupt                                   */
  EXTI8_15_IRQn           = 5,      /*!< EXTI8-15 Line detection Interrupt                                  */
  #else
  EXTI0_1_IRQn            = 4,      /*!< EXTI0-1 Line detection Interrupt                                   */
  EXTI2_3_IRQn            = 5,      /*!< EXTI2-3 Line detection Interrupt                                   */
  #endif
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
  EXTI4_9_IRQn            = 6,      /*!< EXTI4-9 Line detection Interrupt                                   */
  #elif defined(USE_HT32F50020_30) || defined(USE_HT32F65233)
  EXTI4_7_IRQn            = 6,      /*!< EXTI4-7 Line detection Interrupt                                   */
  #elif defined(USE_HT32F66256)
  CORDIC_IRQn             = 6,      /*!< CORDIC global Interrupt                                            */
  #else
  EXTI4_15_IRQn           = 6,      /*!< EXTI4-15 Line detection Interrupt                                  */
  #endif
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined(USE_HT32F66246) || defined(USE_HT32F65233) || defined(USE_HT32F66256)
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
  EXTI10_15_IRQn          = 7,      /*!< EXTI10-15 Line detection Interrupt                                 */
  #elif defined(USE_HT32F66246) || defined(USE_HT32F66256)
  CAN0_IRQn               = 7,      /*!< CAN0 global Interrupt                                              */
  #endif
  ADC0_IRQn               = 8,      /*!< ADC0 Interrupt                                                     */
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F66256)
  ADC1_IRQn               = 9,      /*!< ADC1 Interrupt                                                     */
  #elif defined(USE_HT32F66242) || defined(USE_HT32F66246)
  CORDIC_IRQn             = 9,      /*!< CORDIC global Interrupt                                            */
  #endif
  #if defined(USE_HT32F66256)
  MCTM0_1_BRK_IRQn        = 10,     /*!< MCTM0, MCTM1 BRK Interrupt                                         */
  MCTM0_1_UP_IRQn         = 11,     /*!< MCTM0, MCTM1 UP Interrupt                                          */
  MCTM0_1_TR_UP2_IRQn     = 12,     /*!< MCTM0, MCTM1 TR & UP2 Interrupt                                    */
  MCTM0_1_CC_IRQn         = 13,     /*!< MCTM0, MCTM1 CC Interrupt                                          */
  #else
  MCTM0_BRK_IRQn          = 10,     /*!< MCTM BRK Interrupt                                                 */
  MCTM0_UP_IRQn           = 11,     /*!< MCTM UP Interrupt                                                  */
  MCTM0_TR_UP2_IRQn       = 12,     /*!< MCTM TR & UP2 Interrupt                                            */
  MCTM0_CC_IRQn           = 13,     /*!< MCTM CC Interrupt                                                  */
  #endif
  GPTM0_G_IRQn            = 14,     /*!< GPTM0 G Interrupt                                                  */
  #if defined(USE_HT32F66256)
  GPTM0_1_VCLK_IRQn       = 15,     /*!< GPTM0, GPTM1 VCLK Interrupt                                        */
  #else
  GPTM0_VCLK_IRQn         = 15,     /*!< GPTM VCLK Interrupt                                                */
  #endif
  BFTM0_IRQn              = 16,     /*!< Basic Function Timer0 Interrupt                                    */
  #if defined(USE_HT32F66256)
  BFTM1_2_IRQn            = 17,     /*!< Basic Function Timer1, Timer2 Interrupt                            */
  #else
  BFTM1_IRQn              = 17,     /*!< Basic Function Timer1 Interrupt                                    */
  #endif
  #if defined(USE_HT32F66256)
  CMP0_1_IRQn             = 18,     /*!< Comparator0, Comparator1 Interrupt                                 */
  CMP2_3_IRQn             = 19,     /*!< Comparator2, Comparator3 Interrupt                                 */
  #else
  CMP0_IRQn               = 18,     /*!< Comparator0 Interrupt                                              */
  CMP1_IRQn               = 19,     /*!< Comparator1 Interrupt                                              */
  #endif
  #if defined(USE_HT32F65230_40)
  CMP2_IRQn               = 20,     /*!< Comparator2 Interrupt                                              */
  #elif defined(USE_HT32F66242) || defined(USE_HT32F66246) || defined(USE_HT32F66256)
  PID0_IRQn               = 20,     /*!< PID global Interrupt                                               */
  #endif
  #if defined(USE_HT32F66256)
  I2C0_1_IRQn             = 21,     /*!< I2C0, I2C1 global Interrupt                                        */
  SPI0_1_IRQn             = 22,     /*!< SPI0, SPI1 global Interrupt                                        */
  #else
  I2C0_IRQn               = 21,     /*!< I2C global Interrupt                                               */
  SPI0_IRQn               = 22,     /*!< SPI global Interrupt                                               */
  #endif
  #if !defined(USE_HT32F65233)
  USART0_IRQn             = 23,     /*!< USART global Interrupt                                             */
  #endif
  #if defined(USE_HT32F66256)
  UART0_1_IRQn            = 24,     /*!< UART0, UART1 global Interrupt                                      */
  #else
  UART0_IRQn              = 24,     /*!< UART global Interrupt                                              */
  #endif
  #if defined(USE_HT32F66256)
  GPTM1_G_IRQn            = 25,     /*!< GPTM1 G Interrupt                                                  */
  PDMACH0_2_IRQn          = 26,     /*!< PDMA channel 0-2 Interrupt                                         */
  PDMACH3_5_IRQn          = 27,     /*!< PDMA channel 3-5 Interrupt                                         */
  #else
  PDMACH0_1_IRQn          = 25,     /*!< PDMA channel 0-1 Interrupt                                         */
  PDMACH2_3_IRQn          = 26,     /*!< PDMA channel 2-3 Interrupt                                         */
  PDMACH4_5_IRQn          = 27,     /*!< PDMA channel 4-5 Interrupt                                         */
  #endif
  SCTM0_IRQn              = 28,     /*!< Single Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 29,     /*!< Single Channel Timer1 Interrupt                                    */
  #if !defined(USE_HT32F65233)
  SCTM2_IRQn              = 30,     /*!< Single Channel Timer2 Interrupt                                    */
  SCTM3_IRQn              = 31,     /*!< Single Channel Timer3 Interrupt                                    */
  #endif
  #else
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F52344_54) || defined(USE_HT32F54243_53) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  COMP_IRQn               = 7,      /*!< Comparator global Interrupt                                        */
  #endif
  #if defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52)
  COMP_DAC_IRQn           = 7,      /*!< Comparator & DAC global Interrupt                                  */
  #endif
  #if defined(USE_HT32F52234_44)
  DAC0_1_IRQn             = 7,      /*!< DAC0 & DAC1 global Interrupt                                       */
  #endif
  #if !defined(USE_HT32F0008)
  ADC0_IRQn               = 8,      /*!< ADC Interrupt                                                      */
  #endif
  #if defined(USE_HT32F52243_53) || defined(USE_HT32F54243_53) || defined(USE_HT32F52234_44)
  I2C2_IRQn               = 9,      /*!< I2C2 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F67041_51)
  AES_IRQn                = 9,      /*!< AES global Interrupt                                               */
  #endif
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F0006) && !defined(USE_HT32F57342_52) && !defined(USE_HT32F57331_41) && !defined(USE_HT32F50343) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F67041_51) && !defined(USE_HT32F52234_44)
  MCTM0_IRQn              = 10,     /*!< Motor Control Timer0 interrupt                                     */
  #endif
  #if defined(USE_HT32F50343)
  PWM2_IRQn               = 10,     /*!< PWM Timer2 interrupt                                               */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826)
  GPTM1_IRQn              = 11,     /*!< General-Purpose Timer1 Interrupt                                   */
  #endif
  #if defined(USE_HT32F52357_67)
  QSPI_IRQn               = 11,     /*!< QSPI global Interrupt                                              */
  #endif
  #if defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41)
  LCD_IRQn                = 11,     /*!< LCD global Interrupt                                               */
  #endif
  #if defined(USE_HT32F54231_41) || defined(USE_HT32F54243_53)
  TKEY_IRQn               = 11,     /*!< Touch-Key global Interrupt                                         */
  #endif
  #if defined(USE_HT32F67041_51)
  RF_IRQn                 = 11,     /*!< 2.4G RF global Interrupt                                           */
  #endif
  #if !defined(USE_HT32F50020_30) && !defined(USE_HT32F52234_44)
  GPTM0_IRQn              = 12,     /*!< General-Purpose Timer0 Interrupt                                   */
  #endif
  #if !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F50231_41) && !defined(USE_HT32F57331_41) && !defined(USE_HT32F53231_41) && !defined(USE_HT32F53242_52) && !defined(USE_HT32F50431_41) && !defined(USE_HT32F50442_52)
  SCTM0_IRQn              = 13,     /*!< Single Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 14,     /*!< Single Channel Timer1 Interrupt                                    */
  #endif
  #if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41) || defined(USE_HT32F52243_53) || defined(USE_HT32F0006) || defined(USE_HT32F54243_53) || defined(USE_HT32F50020_30) || defined(USE_HT32F67041_51)
  SCTM2_IRQn              = 15,     /*!< Single Channel Timer2 Interrupt                                    */
  #endif
  #if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41) || defined(USE_HT32F52243_53) || defined(USE_HT32F0006) || defined(USE_HT32F54243_53) || defined(USE_HT32F67041_51)
  SCTM3_IRQn              = 16,     /*!< Single Channel Timer3 Interrupt                                    */
  #endif
  #if defined(USE_HT32F0008) || defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52) || defined(USE_HT32F52234_44)
  PWM0_IRQn               = 15,     /*!< PWM Timer0 Interrupt                                               */
  #endif
  #if defined(USE_HT32F0008) || defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  PWM1_IRQn               = 16,     /*!< PWM Timer1 Interrupt                                               */
  #endif
  BFTM0_IRQn              = 17,     /*!< Basic Function Timer0 Interrupt                                    */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F50020_30)
  BFTM1_IRQn              = 18,     /*!< Basic Function Timer1 Interrupt                                    */
  #endif
  I2C0_IRQn               = 19,     /*!< I2C0 global Interrupt                                              */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F52344_54) && !defined(USE_HT32F0006) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30)
  I2C1_IRQn               = 20,     /*!< I2C1 global Interrupt                                              */
  #endif
  SPI0_IRQn               = 21,     /*!< SPI0 global Interrupt                                              */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F0006) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F52234_44)
  SPI1_IRQn               = 22,     /*!< SPI1 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F0006) || defined(USE_HT32F61244_45)
  QSPI_IRQn               = 22,     /*!< QSPI global Interrupt                                              */
  #endif
  #if !defined(USE_HT32F50220_30) && !defined(USE_HT32F52344_54) && !defined(USE_HT32F50343) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F67041_51)
  USART0_IRQn             = 23,     /*!< USART0 global Interrupt                                            */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F52243_53) || defined(USE_HT32F5826) || defined(USE_HT32F52357_67) || defined(USE_HT32F54243_53) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  USART1_IRQn             = 24,     /*!< USART1 global Interrupt                                            */
  #endif
  UART0_IRQn              = 25,     /*!< UART0 global Interrupt                                             */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F0006) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F52234_44)
  UART1_IRQn              = 26,     /*!< UART1 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F52357_67)
  UART0_UART2_IRQn        = 25,     /*!< UART0 & UART2 global Interrupt                                     */
  UART1_UART3_IRQn        = 26,     /*!< UART1 & UART3 global Interrupt                                     */
  #endif
  #if defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F61141) || defined(USE_HT32F61152)
  SCI_IRQn                = 27,     /*!< Smart Card Interface Interrupt                                     */
  #endif
  #if defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52)
  CAN0_IRQn               = 27,     /*!< CAN0 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F0006) || defined(USE_HT32F61244_45)
  MIDI_IRQn               = 27,     /*!< MIDI global Interrupt                                              */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52)
  I2S_IRQn                = 28,     /*!< I2S global Interrupt                                               */
  #endif
  #if defined(USE_HT32F52243_53) || defined(USE_HT32F54243_53)
  UART2_IRQn              = 27,     /*!< UART2 global Interrupt                                             */
  UART3_IRQn              = 28,     /*!< UART3 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F0008)
  AES_IRQn                = 28,     /*!< AES global Interrupt                                               */
  #endif
  #if defined(USE_HT32F50343)
  SLED0_IRQn              = 27,     /*!< SLED0 global Interrupt                                             */
  SLED1_IRQn              = 28,     /*!< SLED1 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F0008) || defined(USE_HT32F52344_54) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F61141) || defined(USE_HT32F61152)
  USB_IRQn                = 29,     /*!< USB interrupt                                                      */
  #endif
  #if defined(USE_HT32F54231_41) || defined(USE_HT32F54243_53) || defined(USE_HT32F50020_30) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52)
  LEDC_IRQn               = 29,     /*!< LEDC global Interrupt                                              */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F52243_53) || defined(USE_HT32F5826) || defined(USE_HT32F0008) || defined(USE_HT32F52344_54) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F50343) || defined(USE_HT32F54243_53) || defined(USE_HT32F61244_45) || defined(USE_HT32F67041_51) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52) || defined(USE_HT32F52234_44)
  PDMACH0_1_IRQn          = 30,     /*!< PDMA channel 0-1 interrupt                                         */
  PDMACH2_5_IRQn          = 31,     /*!< PDMA channel 2-5 interrupt                                         */
  #endif
  #endif
} IRQn_Type;

#if defined(USE_HT32F66256)
#define EXTI0_IRQn EXTI0_7_IRQn
#define EXTI1_IRQn EXTI0_7_IRQn
#define EXTI2_IRQn EXTI0_7_IRQn
#define EXTI3_IRQn EXTI0_7_IRQn
#define EXTI4_IRQn EXTI0_7_IRQn
#define EXTI5_IRQn EXTI0_7_IRQn
#define EXTI6_IRQn EXTI0_7_IRQn
#define EXTI7_IRQn EXTI0_7_IRQn
#define EXTI8_IRQn EXTI8_15_IRQn
#define EXTI9_IRQn EXTI8_15_IRQn
#define EXTI10_IRQn EXTI8_15_IRQn
#define EXTI11_IRQn EXTI8_15_IRQn
#define EXTI12_IRQn EXTI8_15_IRQn
#define EXTI13_IRQn EXTI8_15_IRQn
#define EXTI14_IRQn EXTI8_15_IRQn
#define EXTI15_IRQn EXTI8_15_IRQn
#else
#define EXTI0_IRQn EXTI0_1_IRQn
#define EXTI1_IRQn EXTI0_1_IRQn
#define EXTI2_IRQn EXTI2_3_IRQn
#define EXTI3_IRQn EXTI2_3_IRQn
#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
#define EXTI4_IRQn EXTI4_9_IRQn
#define EXTI5_IRQn EXTI4_9_IRQn
#define EXTI6_IRQn EXTI4_9_IRQn
#define EXTI7_IRQn EXTI4_9_IRQn
#define EXTI8_IRQn EXTI4_9_IRQn
#define EXTI9_IRQn EXTI4_9_IRQn
#define EXTI10_IRQn EXTI10_15_IRQn
#define EXTI11_IRQn EXTI10_15_IRQn
#define EXTI12_IRQn EXTI10_15_IRQn
#define EXTI13_IRQn EXTI10_15_IRQn
#define EXTI14_IRQn EXTI10_15_IRQn
#define EXTI15_IRQn EXTI10_15_IRQn
#elif defined(USE_HT32F50020_30) || defined(USE_HT32F65233)
#define EXTI4_IRQn EXTI4_7_IRQn
#define EXTI5_IRQn EXTI4_7_IRQn
#define EXTI6_IRQn EXTI4_7_IRQn
#define EXTI7_IRQn EXTI4_7_IRQn
#else
#define EXTI4_IRQn EXTI4_15_IRQn
#define EXTI5_IRQn EXTI4_15_IRQn
#define EXTI6_IRQn EXTI4_15_IRQn
#define EXTI7_IRQn EXTI4_15_IRQn
#define EXTI8_IRQn EXTI4_15_IRQn
#define EXTI9_IRQn EXTI4_15_IRQn
#define EXTI10_IRQn EXTI4_15_IRQn
#define EXTI11_IRQn EXTI4_15_IRQn
#define EXTI12_IRQn EXTI4_15_IRQn
#define EXTI13_IRQn EXTI4_15_IRQn
#define EXTI14_IRQn EXTI4_15_IRQn
#define EXTI15_IRQn EXTI4_15_IRQn
#endif
#endif

#if defined(USE_HT32F66256)
#define PDMACH0_IRQn PDMACH0_2_IRQn
#define PDMACH1_IRQn PDMACH0_2_IRQn
#define PDMACH2_IRQn PDMACH0_2_IRQn
#define PDMACH3_IRQn PDMACH3_5_IRQn
#define PDMACH4_IRQn PDMACH3_5_IRQn
#define PDMACH5_IRQn PDMACH3_5_IRQn
#else
#define PDMACH0_IRQn PDMACH0_1_IRQn
#define PDMACH1_IRQn PDMACH0_1_IRQn
#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined(USE_HT32F66246) || defined(USE_HT32F65233)
#define PDMACH2_IRQn PDMACH2_3_IRQn
#define PDMACH3_IRQn PDMACH2_3_IRQn
#define PDMACH4_IRQn PDMACH4_5_IRQn
#define PDMACH5_IRQn PDMACH4_5_IRQn
#else
#define PDMACH2_IRQn PDMACH2_5_IRQn
#define PDMACH3_IRQn PDMACH2_5_IRQn
#define PDMACH4_IRQn PDMACH2_5_IRQn
#define PDMACH5_IRQn PDMACH2_5_IRQn
#endif
#endif


/**
  * @}
  */

#include "core_cm0plus.h"              /* Cortex-M0+ processor and core peripherals                         */
// Note: Changed for MikroE implementation.
//#include "system_ht32f5xxxx_01.h"      /* HT32 system                                                       */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>


