MikroElektronika/core_packages/ARM/gcc_clang/def/holtek/HT32F61152-46QFN/mcu.h
/**
 * @brief Controller Area Network Global
 */
typedef struct
{
                                 /* CAN: 0x4000C000                                                         */
  __IO uint32_t    CR;           /*!< 0x000         Control Register                                        */
  __IO uint32_t    SR;           /*!< 0x004         Status Register                                         */
  __IO uint32_t    ECR;          /*!< 0x008         Error Counter Register                                  */
  __IO uint32_t    BTR;          /*!< 0x00C         Bit Timing Register                                     */
  __IO uint32_t    IR;           /*!< 0x010         Interrupt Register                                      */
  __IO uint32_t    TR;           /*!< 0x014         Test Register                                           */
  __IO uint32_t    BRPER;        /*!< 0x018         BRP Extension Register                                  */
       uint32_t    RESERVED0[1]; /*!< 0x01C         Reserved                                                */
  HT_CANIF_TypeDef IF0;          /*!< 0x020 - 0x048 CAN Interface 0 registers                               */
       uint32_t    RESERVED1[13];/*!< 0x04C - 0x07C Reserved                                                */
  HT_CANIF_TypeDef IF1;          /*!< 0x080 - 0x0A8 CAN Interface 1 registers                               */
       uint32_t    RESERVED2[21];/*!< 0x0AC - 0x0FC Reserved                                                */
  __IO uint32_t    TRR0;         /*!< 0x100         Transmission Request Register 0                         */
  __IO uint32_t    TRR1;         /*!< 0x104         Transmission Request Register 1                         */
       uint32_t    RESERVED3[6]; /*!< 0x108 - 0x11C Reserved                                                */
  __IO uint32_t    NDR0;         /*!< 0x120         New Data Register 0                                     */
  __IO uint32_t    NDR1;         /*!< 0x124         New Data Register 1                                     */
       uint32_t    RESERVED4[6]; /*!< 0x128 - 0x13C Reserved                                                */
  __IO uint32_t    IPR0;         /*!< 0x140         Interrupt Pending Register 0                            */
  __IO uint32_t    IPR1;         /*!< 0x144         Interrupt Pending Register 1                            */
       uint32_t    RESERVED5[6]; /*!< 0x148 - 0x15C Reserved                                                */
  __IO uint32_t    MVR0;         /*!< 0x160         Message Valid Register 0                                */
  __IO uint32_t    MVR1;         /*!< 0x164         Message Valid Register 1                                */
} HT_CAN_TypeDef;


/**
 * @brief Coordinate Rotation Digital Computer
 */
typedef struct
{
                                 /* CORDIC: 0x400DC000                                                      */
  __IO uint32_t    CSR;          /*!< 0x000         Control/Satus Register                                  */
  __IO uint32_t    WDATA;        /*!< 0x004         Argument Register                                       */
  __IO uint32_t    RDATA;        /*!< 0x008         Result Register                                         */
} HT_CORDIC_TypeDef;

/**
 * @brief Proportional Mode parameters
 */
#if defined(USE_HT32F66246) || defined(USE_HT32F66242)
typedef struct
{
  __IO uint32_t LEIR;           /*!< 0x000         Last Error Input Register                                */
  __IO uint32_t KPIR;           /*!< 0x004         KP Input Register                                        */
  __IO uint32_t KIIR;           /*!< 0x008         KI Input Register                                        */
  __IO uint32_t KDIR;           /*!< 0x00C         KD Input Register                                        */
  __IO uint32_t LIFVR;          /*!< 0x010         Last Integral Function Value Register                    */
  __IO uint32_t IFVMAXLR;       /*!< 0x014         Integral Function Value Maximum Limitation Register      */
  __IO uint32_t IFVMINLR;       /*!< 0x018         Integral Function Value Minimum Limitation Register      */
  __IO uint32_t PIDORLR;        /*!< 0x01C         PID Output Result Limitation Register                    */
} HT_PIDPARA_TypeDef;
#else
typedef struct
{
  __IO uint32_t KPIR;           /*!< 0x000         KP Input Register                                        */
  __IO uint32_t KDIR;           /*!< 0x004         KD Input Register                                        */
  __IO uint32_t LEIR;           /*!< 0x008         Last Error Input Register                                */
  __IO uint32_t KIIR;           /*!< 0x00C         KI Input Register                                        */
  __IO uint32_t LIFVR;          /*!< 0x010         Last Integral Function Value Register                    */
  __IO uint32_t IFVMAXLR;       /*!< 0x014         Integral Function Value Maximum Limitation Register      */
  __IO uint32_t IFVMINLR;       /*!< 0x018         Integral Function Value Minimum Limitation Register      */
  __IO uint32_t PIDMAXLR;       /*!< 0x01C         PID Output Result Maximum Limitation Register            */
  __IO uint32_t PIDMINLR;       /*!< 0x020         PID Output Result Minimum Limitation Register            */
} HT_PIDPARA_TypeDef;
#endif
/**
  * @}
  */

/**
 * @brief Proportional Integral Derivative controller
 */
#if defined(USE_HT32F66246)
typedef struct
{
                                 /* PID: 0x400EC000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t IFIVR;           /*!< 0x004         Integral Function Input Value Register                  */
  __IO uint32_t EIVR;            /*!< 0x008         Error Input Value Register                              */
  __IO uint32_t ORR;             /*!< 0x00C         Output Result Register                                  */
  HT_PIDPARA_TypeDef SPD;        /*!< 0x010 - 0x02C SPD Mode                                                */
  HT_PIDPARA_TypeDef IQ;         /*!< 0x030 - 0x04C IQ Mode                                                 */
  HT_PIDPARA_TypeDef ID;         /*!< 0x050 - 0x06C ID Mode                                                 */
  HT_PIDPARA_TypeDef FWNK;       /*!< 0x070 - 0x08C FWNK Mode                                               */
  HT_PIDPARA_TypeDef PLL;        /*!< 0x090 - 0x0AC PLL Mode                                                */
  HT_PIDPARA_TypeDef USR;        /*!< 0x0B0 - 0x0CC USR Mode                                                */
} HT_PID_TypeDef;
#else
typedef struct
{
                                 /* PID: 0x400EC000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t IFIVR;           /*!< 0x004         Integral Function Input Value Register                  */
  __IO uint32_t EIVR;            /*!< 0x008         Error Input Value Register                              */
  __IO uint32_t ORR;             /*!< 0x00C         Output Result Register                                  */
  HT_PIDPARA_TypeDef SPD;        /*!< 0x010 - 0x030 SPD Mode                                                */
  HT_PIDPARA_TypeDef IQ;         /*!< 0x034 - 0x054 IQ Mode                                                 */
  HT_PIDPARA_TypeDef ID;         /*!< 0x058 - 0x078 ID Mode                                                 */
  HT_PIDPARA_TypeDef FWNK;       /*!< 0x07C - 0x09C FWNK Mode                                               */
  HT_PIDPARA_TypeDef PLL;        /*!< 0x0A0 - 0x0C0 PLL Mode                                                */
  HT_PIDPARA_TypeDef USR;        /*!< 0x0C4 - 0x0E4 USR Mode                                                */
  HT_PIDPARA_TypeDef SPD1;       /*!< 0x0E8 - 0x108 SPD1 Mode                                               */
  HT_PIDPARA_TypeDef IQ1;        /*!< 0x10C - 0x12C IQ1 Mode                                                */
  HT_PIDPARA_TypeDef ID1;        /*!< 0x130 - 0x150 ID1 Mode                                                */
  HT_PIDPARA_TypeDef FWNK1;      /*!< 0x154 - 0x174 FWNK1 Mode                                              */
  HT_PIDPARA_TypeDef PLL1;       /*!< 0x178 - 0x198 PLL1 Mode                                               */
  HT_PIDPARA_TypeDef USR1;       /*!< 0x19C - 0x1BC USR1 Mode                                               */
} HT_PID_TypeDef;
#endif
/**
  * @}
  */


/**
 * @brief RF
 */
typedef struct
{
                                 /* RF: 0x400D0000                                                          */
  __IO uint8_t TRXADR0;          /*!< 0x000         TX/RX ADDRESS 5BYTES(LSB)                               */
  __IO uint8_t TRXADR1;          /*!< 0x001         TX/RX ADDRESS 5BYTES                                    */
  __IO uint8_t TRXADR2;          /*!< 0x002         TX/RX ADDRESS 5BYTES                                    */
  __IO uint8_t TRXADR3;          /*!< 0x003         TX/RX ADDRESS 5BYTES                                    */
  __IO uint8_t TRXADR4;          /*!< 0x004         TX/RX ADDRESS 5BYTES(MSB)                               */
  __IO uint8_t RXP1ADR0;         /*!< 0x005         RX PIPE1 ADDRESS 5BYTES(LSB)                            */
  __IO uint8_t RXP1ADR1;         /*!< 0x006         RX PIPE1 ADDRESS 5BYTES                                 */
  __IO uint8_t RXP1ADR2;         /*!< 0x007         RX PIPE1 ADDRESS 5BYTES                                 */
  __IO uint8_t RXP1ADR3;         /*!< 0x008         RX PIPE1 ADDRESS 5BYTES                                 */
  __IO uint8_t RXP1ADR4;         /*!< 0x009         RX PIPE1 ADDRESS 5BYTES(MSB)                            */
  __IO uint8_t RXP2ADR0;         /*!< 0x00A         RX PIPE2 ADDRESS 5BYTES(LSB)                            */
  __IO uint8_t RXP3ADR0;         /*!< 0x00B         RX PIPE3 ADDRESS 5BYTES(LSB)                            */
  __IO uint8_t RXP4ADR0;         /*!< 0x00C         RX PIPE4 ADDRESS 5BYTES(LSB)                            */
  __IO uint8_t RXP5ADR0;         /*!< 0x00D         RX PIPE5 ADDRESS 5BYTES(LSB)                            */
       uint8_t RESERVED0[2];     /*!< 0x00E - 0x00F Reserved                                                */
  __IO uint8_t TXFIFO;           /*!< 0x010         TX FIFO WRITE ONLY                                      */
       uint8_t RESERVED1[3];     /*!< 0x011 - 0x013 Reserved                                                */
  __IO uint8_t RXFIFO;           /*!< 0x014         RX FIFO READ ONLY                                       */
       uint8_t RESERVED2[3];     /*!< 0x015 - 0x017 Reserved                                                */
  __IO uint8_t FWREND;           /*!< 0x018         FIFO Read/Write End                                     */
  __IO uint8_t FLUSHFF;          /*!< 0x019         FLUSH TX/RX FIFO                                        */
  __IO uint8_t TXFFSEL;          /*!< 0x01A         Write TX FIFO Select ACK Payload or NACK Payload        */
  __IO uint8_t PIPESEL;          /*!< 0x01B         Write TX FIFO for PIPE ACK Payload                      */
  __IO uint8_t RFC1;             /*!< 0x01C         RF Control Register 1                                   */
  __IO uint8_t RFC2;             /*!< 0x01D         RF Control Register 2                                   */
  __IO uint8_t RFC3;             /*!< 0x01E         RF Control Register 3                                   */
       uint8_t RESERVED3[1];     /*!< 0x01F         Reserved                                                */
  __IO uint8_t CFG1;             /*!< 0x020         Configuration Control Register 1                        */
  __IO uint8_t RC1;              /*!< 0x021         Reset/Clock Control Register 1                          */
  __IO uint8_t RC2;              /*!< 0x022         Reset/Clock Control Register 2                          */
  __IO uint8_t MASK;             /*!< 0x023         Mask Control Register                                   */
  __IO uint8_t IRQ1;             /*!< 0x024         Interrupt Control Register 1                            */
  __IO uint8_t STATUS;           /*!< 0x025         FIFO Status Control Register                            */
  __IO uint8_t IO1;              /*!< 0x026         IO Control Register 1                                   */
  __IO uint8_t IO2;              /*!< 0x027         IO Control Register 2                                   */
  __IO uint8_t IO3;              /*!< 0x028         IO Control Register 3                                   */
  __IO uint8_t PKT1;             /*!< 0x029         Packet Control Register 1                               */
  __IO uint8_t PKT2;             /*!< 0x02A         Packet Control Register 2                               */
  __IO uint8_t PKT3;             /*!< 0x02B         Packet Control Register 3                               */
  __IO uint8_t PKT4;             /*!< 0x02C         Packet Control Register 4                               */
  __IO uint8_t PKT5;             /*!< 0x02D         Packet Control Register 5                               */
  __IO uint8_t MOD1;             /*!< 0x02E         Modulator Control Register 1                            */
  __IO uint8_t MOD2;             /*!< 0x02F         Modulator Control Register 2                            */
  __IO uint8_t DM1;              /*!< 0x030         De-modulator Control Register 1                         */
  __IO uint8_t DM2;              /*!< 0x031         De-modulator Control Register 2                         */
  __IO uint8_t RT1;              /*!< 0x032         PTX Retransmission Control Register 1                   */
  __IO uint8_t RT2;              /*!< 0x033         PTX Retransmission Control Register 2                   */
  __IO uint8_t CE;               /*!< 0x034         Chip Enable Control Register                            */
  __IO uint8_t CP21;             /*!< 0x035         CP Control Register 21                                  */
  __IO uint8_t CP22;             /*!< 0x036         CP Control Register 22                                  */
  __IO uint8_t CP31;             /*!< 0x037         CP Control Register 31                                  */
  __IO uint8_t CP2R;             /*!< 0x038         CP Control Register 2 for Read                          */
  __IO uint8_t CP3R;             /*!< 0x039         CP Control Register 3 for Read                          */
  __IO uint8_t CP2RX;            /*!< 0x03A         CP Control Register 2 for RX                            */
  __IO uint8_t CP3RX;            /*!< 0x03B         CP Control Register 3 for RX                            */
  __IO uint8_t PDB;              /*!< 0x03C         RF Power Down Bar Enable Control Register               */
  __IO uint8_t RF1;              /*!< 0x03D         RF RX control Register 1                                */
       uint8_t RESERVED4[2];     /*!< 0x03E - 0x03F Reserved                                                */
  __IO uint8_t OM;               /*!< 0x040         Operation Mode Control Register                         */
  __IO uint8_t CFO1;             /*!< 0x041         Carrier Frequency Offset Control Register 1             */
  __IO uint8_t SX1;              /*!< 0x042         Fractional-N Synthesizer Control Register 1             */
  __IO uint8_t SX2;              /*!< 0x043         Fractional-N Synthesizer Control Register 2             */
  __IO uint8_t SX3;              /*!< 0x044         Fractional-N Synthesizer Control Register 3             */
  __IO uint8_t SX4;              /*!< 0x045         Fractional-N Synthesizer Control Register 4             */
  __IO uint8_t STA1;             /*!< 0x046         Status Control Register 1                               */
  __IO uint8_t RSSI1;            /*!< 0x047         RSSI Control Register 1                                 */
  __IO uint8_t RSSI2;            /*!< 0x048         RSSI Control Register 2                                 */
  __IO uint8_t RSSI3;            /*!< 0x049         RSSI Control Register 3                                 */
  __IO uint8_t DPL1;             /*!< 0x04A         Dynamic Payload Length Control Register 1               */
  __IO uint8_t DPL2;             /*!< 0x04B         Dynamic Payload Length Control Register 2               */
  __IO uint8_t RXPW0;            /*!< 0x04C         RX Payload Length Control Register 0                    */
  __IO uint8_t RXPW1;            /*!< 0x04D         RX Payload Length Control Register 1                    */
  __IO uint8_t RXPW2;            /*!< 0x04E         RX Payload Length Control Register 2                    */
  __IO uint8_t RXPW3;            /*!< 0x04F         RX Payload Length Control Register 3                    */
  __IO uint8_t RXPW4;            /*!< 0x050         RX Payload Length Control Register 4                    */
  __IO uint8_t RXPW5;            /*!< 0x051         RX Payload Length Control Register 5                    */
  __IO uint8_t ENAA;             /*!< 0x052         Enable Auto-ACK Control Register                        */
  __IO uint8_t PEN;              /*!< 0x053         Pipe Enable Control Register                            */
  __IO uint8_t XO1;              /*!< 0x054         XO Control Register 1                                   */
  __IO uint8_t XO2;              /*!< 0x055         XO Control Register 2                                   */
  __IO uint8_t TXP1;             /*!< 0x056         TX Power Control Register 1                             */
  __IO uint8_t DM3;              /*!< 0x057         De-modulator Control Register 3                         */
  __IO uint8_t AGC1;             /*!< 0x058         AGC Control Register 1                                  */
  __IO uint8_t AGC2;             /*!< 0x059         AGC Control Register 2                                  */
  __IO uint8_t AGC3;             /*!< 0x05A         AGC Control Register 3                                  */
  __IO uint8_t AGC4;             /*!< 0x05B         AGC Control Register 4                                  */
  __IO uint8_t FCF1;             /*!< 0x05C         Filter Coefficient Control Register 1                   */
  __IO uint8_t FCF2;             /*!< 0x05D         Filter Coefficient Control Register 2                   */
  __IO uint8_t FCF3;             /*!< 0x05E         Filter Coefficient Control Register 3                   */
  __IO uint8_t FCF4;             /*!< 0x05F         Filter Coefficient Control Register 4                   */
  __IO uint8_t RXG;              /*!< 0x060         RX Gain Control Register                                */
  __IO uint8_t CP1;              /*!< 0x061         CP Control Register 1                                   */
  __IO uint8_t CP2;              /*!< 0x062         CP Control Register 2                                   */
  __IO uint8_t CP3;              /*!< 0x063         CP Control Register 3                                   */
  __IO uint8_t OD1;              /*!< 0x064         MMD and OD Control Register 1                           */
  __IO uint8_t OD2;              /*!< 0x065         MMD and OD Control Register 2                           */
  __IO uint8_t VC1;              /*!< 0x066         VCO Control Register 1                                  */
  __IO uint8_t VC2;              /*!< 0x067         VCO Control Register 2                                  */
  __IO uint8_t VC3;              /*!< 0x068         VCO Control Register 3                                  */
  __IO uint8_t RX1;              /*!< 0x069         RX Control Register 1                                   */
  __IO uint8_t RX2;              /*!< 0x06A         RX Control Register 2                                   */
  __IO uint8_t RX3;              /*!< 0x06B         RX Control Register 3                                   */
  __IO uint8_t RX4;              /*!< 0x06C         RX Control Register 4                                   */
  __IO uint8_t RX5;              /*!< 0x06D         RX Control Register 5                                   */
  __IO uint8_t TX1;              /*!< 0x06E         TX Control Register 1                                   */
  __IO uint8_t TX2;              /*!< 0x06F         TX Control Register 2                                   */
  __IO uint8_t TX3;              /*!< 0x070         TX Control Register 3                                   */
  __IO uint8_t CA1;              /*!< 0x071         VCO DFC Calibration Control Register 1                  */
  __IO uint8_t CA2;              /*!< 0x072         VCO DFC Calibration Control Register 2                  */
  __IO uint8_t CA3;              /*!< 0x073         VCO DFC Calibration Control Register 3                  */
  __IO uint8_t LD1;              /*!< 0x074         LDO Control Register 1                                  */
  __IO uint8_t LD2;              /*!< 0x075         LDO Control Register 2                                  */
  __IO uint8_t LD3;              /*!< 0x076         LDO Control Register 3                                  */
  __IO uint8_t RTM1;             /*!< 0x077         RF Test Mode Control Register 1                         */
       uint8_t RESERVED5[8];     /*!< 0x078 - 0x07F Reserved                                                */
  __IO uint8_t TEST1;            /*!< 0x080         Test Control Register 1                                 */
  __IO uint8_t TEST2;            /*!< 0x081         Test Control Register 2                                 */
  __IO uint8_t TEST3;            /*!< 0x082         Test Control Register 3                                 */
  __IO uint8_t TEST4;            /*!< 0x083         Test Control Register 4                                 */
  __IO uint8_t TEST5;            /*!< 0x084         Test Control Register 5                                 */
  __IO uint8_t TEST6;            /*!< 0x085         Test Control Register 6                                 */
  __IO uint8_t TEST7;            /*!< 0x086         Test Control Register 7                                 */
} HT_RF_TypeDef;
/**
  * @}
  */

/** @addtogroup Peripheral_Memory_Map
  * @{
  */

#define HT_SRAM_BASE             (0x20000000UL)

#define HT_PERIPH_BASE           (0x40000000UL)

