MikroElektronika/core_packages/ARM/gcc_clang/def/holtek/HT32F61152-46QFN/mcu.h
#if defined(USE_HT32F52234_44)
#define HT_PDMA                  ((HT_PDMA_TypeDef *) HT_PDMA_BASE)
#define HT_BFTM1                 ((HT_BFTM_TypeDef *) HT_BFTM1_BASE)
#define HT_PWM0                  ((HT_TM_TypeDef *) HT_PWM0_BASE)
#define HT_DAC0                  ((HT_DAC_TypeDef *) HT_DAC0_BASE)
#define HT_DAC1                  ((HT_DAC_TypeDef *) HT_DAC1_BASE)
#define HT_I2C1                  ((HT_I2C_TypeDef *) HT_I2C1_BASE)
#define HT_I2C2                  ((HT_I2C_TypeDef *) HT_I2C2_BASE)
#define HT_RTC                   ((HT_RTC_TypeDef *) HT_RTC_BASE)
#define HT_CRC                   ((HT_CRC_TypeDef *) HT_CRC_BASE)
#define HT_DIV                   ((HT_DIV_TypeDef *) HT_DIV_BASE)
#define HT_GPIOC                 ((HT_GPIO_TypeDef *) HT_GPIOC_BASE)
#endif

#if defined(USE_HT32F66256)
#define HT_PDMA                  ((HT_PDMA_TypeDef *) HT_PDMA_BASE)
#define HT_ADC1                  ((HT_ADC_TypeDef *) HT_ADC1_BASE)
#define HT_CMP0                  ((HT_CMP_TypeDef *) HT_CMP0_BASE)
#define HT_CMP1                  ((HT_CMP_TypeDef *) HT_CMP1_BASE)
#define HT_CMP2                  ((HT_CMP_TypeDef *) HT_CMP2_BASE)
#define HT_CMP3                  ((HT_CMP_TypeDef *) HT_CMP3_BASE)
#define HT_BFTM1                 ((HT_BFTM_TypeDef *) HT_BFTM1_BASE)
#define HT_BFTM2                 ((HT_BFTM_TypeDef *) HT_BFTM2_BASE)
#define HT_GPTM1                 ((HT_TM_TypeDef *) HT_GPTM1_BASE)
#define HT_MCTM0                 ((HT_TM_TypeDef *) HT_MCTM0_BASE)
#define HT_MCTM1                 ((HT_TM_TypeDef *) HT_MCTM1_BASE)
#define HT_CRC                   ((HT_CRC_TypeDef *) HT_CRC_BASE)
#define HT_DIV                   ((HT_DIV_TypeDef *) HT_DIV_BASE)
#define HT_GPIOC                 ((HT_GPIO_TypeDef *) HT_GPIOC_BASE)
#define HT_GPIOD                 ((HT_GPIO_TypeDef *) HT_GPIOD_BASE)
#define HT_CAN0                  ((HT_CAN_TypeDef *) HT_CAN0_BASE)
#define HT_PGA0                  ((HT_PGA0_X_TypeDef *) HT_PGA0_BASE)
#define HT_PGA1                  ((HT_PGA0_X_TypeDef *) HT_PGA1_BASE)
#define HT_PGA2                  ((HT_PGA0_X_TypeDef *) HT_PGA2_BASE)
#define HT_PGA3                  ((HT_PGA0_X_TypeDef *) HT_PGA3_BASE)
#define HT_PGA4                  ((HT_PGA0_X_TypeDef *) HT_PGA4_BASE)
#define HT_PGA5                  ((HT_PGA0_X_TypeDef *) HT_PGA5_BASE)
#define HT_PGA                   ((HT_PGA_TypeDef *) HT_PGA_BASE)
#define HT_PID0                  ((HT_PID_TypeDef *) HT_PID0_BASE)
#define HT_CORDIC                ((HT_CORDIC_TypeDef *) HT_CORDIC_BASE)
#define HT_RTC                   ((HT_RTC_TypeDef *) HT_RTC_BASE)
#define HT_UART1                 ((HT_USART_TypeDef *) HT_UART1_BASE)
#define HT_SPI1                  ((HT_SPI_TypeDef *) HT_SPI1_BASE)
#define HT_I2C1                  ((HT_I2C_TypeDef *) HT_I2C1_BASE)
#endif

#if defined USE_HT32_DRIVER
//  #include "ht32f5xxxx_lib.h"// Note: Changed for MikroE implementation.
#endif

/**
 * @brief Adjust the value of High Speed External oscillator (HSE)
          Tip: To avoid from modifying every time for different HSE, please define
          the "HSE_VALUE=n000000" ("n" represents n MHz) in your own toolchain compiler preprocessor,
          or edit the "HSE_VALUE" in the "ht32f5xxxx_conf.h" file.
  */
#if !defined  HSE_VALUE
  #if defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41)
    /* Available HSE_VALUE: 4 MHz ~ 20 MHz                                                                  */
    #define HSE_VALUE       20000000UL /*!< Value of the External oscillator in Hz                          */
  #elif defined(USE_HT32F50020_30)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       16000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F0006)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       12000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F61244_45)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       12000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F67041_51)
    /* Available HSE_VALUE: 16 MHz                                                                          */
    #define HSE_VALUE       16000000UL  /*!< Value of the External oscillator in Hz                         */
  #else
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       8000000UL  /*!< Value of the External oscillator in Hz                          */
  #endif
#endif

/**
 * @brief Define for backward compatibility
 */
#define HT_ADC                   HT_ADC0
#define ADC                      ADC0
#define ADC_IRQn                 ADC0_IRQn
#define AFIO_FUN_ADC             AFIO_FUN_ADC0
#define CKCU_PCLK_ADC            CKCU_PCLK_ADC0

#define HT_DAC                   HT_DAC0
#define AFIO_FUN_DAC             AFIO_FUN_DAC0
#define CKCU_PCLK_DAC            CKCU_PCLK_DAC0

#define CMP_CVREF0_CN_IN         CMP0_CVREF0_CN_IN

#define PID_SPD_MODE             PID_SPD0_MODE
#define PID_IQ_MODE              PID_IQ0_MODE
#define PID_ID_MODE              PID_ID0_MODE
#define PID_FWNK_MODE            PID_FWNK0_MODE
#define PID_PLL_MODE             PID_PLL0_MODE
#define PID_USR_MODE             PID_USR0_MODE

#if defined(USE_HT32F52357_67)
  #define UART0_IRQn             UART0_UART2_IRQn
  #define UART2_IRQn             UART0_UART2_IRQn
  #define UART1_IRQn             UART1_UART3_IRQn
  #define UART3_IRQn             UART1_UART3_IRQn
#endif

#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined(USE_HT32F66246) || defined(USE_HT32F65233)
  // Alias
  #define GPTM0_IRQn             GPTM0_G_IRQn
  #define GPTM0_IRQHandler       GPTM0_G_IRQHandler
  #define MCTM0_IRQn             MCTM0_UP_IRQn
  #define MCTM0_IRQHandler       MCTM0_UP_IRQHandler
  #define MCTM1_IRQn             MCTM1_UP_IRQn
  #define MCTM1_IRQHandler       MCTM1_UP_IRQHandler
#endif

#if defined(USE_HT32F65233)
  #define ADC_IRQHandler         ADC0_IRQHandler
#endif

#if defined(USE_HT32F66256)
  #define ADC_IRQHandler         ADC0_IRQHandler
  #define GPTM0_IRQn             GPTM0_G_IRQn
  #define GPTM0_IRQHandler       GPTM0_G_IRQHandler
  #define GPTM1_IRQn             GPTM1_G_IRQn
  #define GPTM1_IRQHandler       GPTM1_G_IRQHandler
  #define MCTM0_IRQn             MCTM0_1_UP_IRQn
  #define MCTM0_IRQHandler       MCTM0_1_UP_IRQHandler
  #define MCTM1_IRQn             MCTM0_1_UP_IRQn
  #define MCTM1_IRQHandler       MCTM0_1_UP_IRQHandler
  #define UART0_IRQn             UART0_1_IRQn
  #define UART0_IRQHandler       UART0_1_IRQHandler
  #define UART1_IRQn             UART0_1_IRQn
  #define UART1_IRQHandler       UART0_1_IRQHandler
  #define CMP0_IRQn              CMP0_1_IRQn
  #define CMP0_IRQHandler        CMP0_1_IRQHandler
  #define CMP1_IRQn              CMP0_1_IRQn
  #define CMP1_IRQHandler        CMP0_1_IRQHandler
  #define CMP2_IRQn              CMP2_3_IRQn
  #define CMP2_IRQHandler        CMP2_3_IRQHandler
  #define CMP3_IRQn              CMP2_3_IRQn
  #define CMP3_IRQHandler        CMP2_3_IRQHandler
  #define I2C0_IRQn              I2C0_1_IRQn
  #define I2C0_IRQHandler        I2C0_1_IRQHandler
  #define I2C1_IRQn              I2C0_1_IRQn
  #define I2C1_IRQHandler        I2C0_1_IRQHandler
  #define SPI0_IRQn              SPI0_1_IRQn
  #define SPI0_IRQHandler        SPI0_1_IRQHandler
  #define SPI1_IRQn              SPI0_1_IRQn
  #define SPI1_IRQHandler        SPI0_1_IRQHandler

  #define ADC_CH_PGA0O           ADC0_CH_PGA0O
  #define ADC_CH_PGA1O           ADC0_CH_PGA1O
  #define ADC_CH_PGA2O           ADC0_CH_PGA2O
  #define ADC_CH_PGA3O           ADC0_CH_PGA3O
  #define ADC_CH_VTS             ADC0_CH_VTS

  #define CMP_TRIG_GPTM_CH0      CMP_TRIG_GPTM0_CH0
  #define CMP_TRIG_GPTM_CH1      CMP_TRIG_GPTM0_CH1
  #define CMP_TRIG_GPTM_CH2      CMP_TRIG_GPTM0_CH2
  #define CMP_TRIG_GPTM_CH3      CMP_TRIG_GPTM0_CH3
  #define CMP_TRIG_MCTM_CH3      CMP_TRIG_MCTM0_CH3
  #define CMP_TRIG_MCTM_BK0      CMP_TRIG_MCTM0_BK0
  #define CMP_TRIG_MCTM_BK1      CMP_TRIG_MCTM0_BK1
  #define CMP_CVREF0_CN_IN       CMP0_CVREF0_CN_IN
#endif

#define AFIO_ESS_Enum            u32

#if 0 // Set as 1 for backward compatibility
#if defined(USE_HT32F50020_30)
#define EXTI8_IRQn               EXTI0_1_IRQn
#define EXTI9_IRQn               EXTI0_1_IRQn
#define EXTI10_IRQn              EXTI2_3_IRQn
#define EXTI11_IRQn              EXTI2_3_IRQn
#define EXTI12_IRQn              EXTI4_7_IRQn
#define EXTI13_IRQn              EXTI4_7_IRQn
#define EXTI14_IRQn              EXTI4_7_IRQn
#define EXTI15_IRQn              EXTI4_7_IRQn

#define EXTI_CHANNEL_8           EXTI_CHANNEL_0
#define EXTI_CHANNEL_9           EXTI_CHANNEL_1
#define EXTI_CHANNEL_10          EXTI_CHANNEL_2
#define EXTI_CHANNEL_11          EXTI_CHANNEL_3
#define EXTI_CHANNEL_12          EXTI_CHANNEL_4
#define EXTI_CHANNEL_13          EXTI_CHANNEL_5
#define EXTI_CHANNEL_14          EXTI_CHANNEL_6
#define EXTI_CHANNEL_15          EXTI_CHANNEL_7
#endif
#endif

#if (LIBCFG_SPI_NO_MULTI_MASTER)
#define SPI_SELOutputCmd(...)
#endif

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
